package PracticeCode.Prac6;
/*
* 알파코드
철수와 영희는 서로의 비밀편지를 암호화해서 서로 주고받기로 했다.
그래서 서로 어떻게 암호화를 할 것인지 의논을 하고 있다.
영희 : 우리 알파벳 A에는 1로, B에는 2로 이렇게 해서 Z에는 26을 할당하여 번호로 보내기
로 하자.
철수 : 정말 바보같은 생각이군!! 생각해 봐!! 만약 내가 “BEAN"을 너에게 보낸다면 그것을 암
호화하면 25114이잖아!! 그러면 이것을 다시 알파벳으로 복원할 때는 많은 방법이 존재하는
데 어떻게 할건데... 이것을 알파벳으로 바꾸면 BEAAD, YAAD, YAN, YKD 그리고 BEKD로
BEAN말고도 5가지나 더 있군.
당신은 위와 같은 영희의 방법으로 암호화된 코드가 주어지면 그것을 알파벳으로 복원하는데
얼마나 많은 방법이 있는지 알고싶습니다.
매개변수 s에 암호화된 숫자가 문자열형태로 주어지면 이 것을 알파벳으로 복원하는 방법의
가지수를 반환하는 프로그램을 작성하세요.
* */
public class Prob3 {

}
